In [1]:
import sqlite3
import pandas as pd

In [2]:
db=sqlite3.connect('School.sqlite')

In [3]:
data=pd.read_sql_query('Select * from Student',db)

In [4]:
data

   Rollnumber    Name  Age
0         101   Sanju   30
1         102   kumar   30
2         104   Reddy   30
3         106   Varun   50
4         107    Sasi   20
5         108  Nithin   20

In [5]:
data['Age']==20

0    False
1    False
2    False
3    False
4     True
5     True
Name: Age, dtype: bool

In [6]:
data[data['Age']==20]

   Rollnumber    Name  Age
4         107    Sasi   20
5         108  Nithin   20

In [7]:
data=pd.DataFrame([[201,"Nithin","English",15000],[202,"Sasi","Maths",20000],[203,"Akhil","Biology",25000]], columns=["Id","Name","Course","Salary"])
data

    Id    Name   Course  Salary
0  201  Nithin  English   15000
1  202    Sasi    Maths   20000
2  203   Akhil  Biology   25000

In [8]:
data.to_sql("Faculty",db)

In [9]:
data=pd.read_sql_query('Select * from Student',db)

In [11]:
data['Address']='Test'

In [12]:
data

   Rollnumber    Name  Age Address
0         101   Sanju   30    Test
1         102   kumar   30    Test
2         104   Reddy   30    Test
3         106   Varun   50    Test
4         107    Sasi   20    Test
5         108  Nithin   20    Test

In [13]:
data.to_sql("Student",db,if_exists="replace")